tutorials/cases/prescribedUsCases/convergingJam/constant/pyrolysisProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      pyrolysisProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Pyrolysis active so volPyrolysis::solveSpeciesMass() runs and transports the
// solid species by Us. With chemistry off the reaction source is zero, so the
// species equation is pure advection.
active          true;

heterogeneousPyrolysisModel  volPyrolysis;

pyrolysisCoeffs
{
    subintegrateHeatTransfer true;
    bedCollapse      false;
    criticalPorosity 0.9999;
    replenish        false;

    // Packing limit -- the largest solid volume fraction a cell may hold.
    // volPyrolysis::solidReceiverLimit() refuses any solid flux that would
    // carry a cell past porosityF = minPorosity, and this case exists to make
    // that cap bind: at 0.4 a cell is stopped at 60 % solid, the limiter
    // reports on 240 of the run's 250 steps, and it withholds up to
    // 1.77e-10 m3 -- 17.7 % of the 1e-09 m3 cell volume.
    //
    // The key has to be set to something. The default 0 admits a cell with no
    // void left at all, and the gas continuity equation's
    // fvm::ddt(porosityF, rho) diagonal then goes to zero: the run dies with a
    // SIGFPE inside Foam::diagonalSolver rather than through any solver
    // diagnostic. convergingJamTight is this case at minPorosity 0.1 -- 90 %
    // solid allowed, nearer that cliff and correspondingly limiting less.
    minPorosity      0.4;
}

infoOutput      true;

// ************************************************************************* //
