tutorials/cases/prescribedUsCases/convergingJam/constant/reactions
species
(
    N2
);

reactions
{
}
